# Taps
tap 'AdoptOpenJDK/openjdk'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'
tap 'aws/tap'

# Binaries
brew 'aws-cdk'
brew 'aws-sam-cli'
brew 'awscli'
brew 'composer'
brew 'git'
brew 'go'
brew 'groovy'
brew 'htop'
brew 'httpie'
brew 'jq'
brew 'k6'
brew 'k9s'
brew 'kafka'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'mackup'
brew 'maven'
brew 'mysql'
brew 'mysql@5.7'
brew 'nginx'
brew 'node'
brew 'node@14'
brew 'openjdk'
brew 'openjdk@11'
brew 'php'
brew 'php@7.4'
brew 'postgresql'
brew 'postgresql@10'
brew 'python@3.7'
brew 'python@3.8'
brew 'python@3.9'
brew 'redis'
brew 'sops'
brew 'sqlite'
brew 'telnet'
brew 'trash'
brew 'tree'
brew 'wget'
brew 'yarn'
brew 'zsh'

# Apps
cask '1password'
cask 'adoptopenjdk8'
cask 'adoptopenjdk14'
cask 'corretto'
cask 'docker'
cask 'dropbox'
cask 'fantastical'
cask 'github'
cask 'google-chrome'
cask 'google-drive'
cask 'insomnia'
cask 'intellij-idea'
cask 'iterm2'
cask 'loom'
cask 'microsoft-powerpoint'
cask 'microsoft-teams'
cask 'microsoft-word'
cask 'notion'
cask 'oracle-jdk'
cask 'signal'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'tableplus'
cask 'visual-studio-code'
cask 'zoom'
