# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'aws/tap'
tap 'pulumi/tap'

# Binaries
brew 'aws-cdk'
brew 'aws-sam-cli'
brew 'awscli'
brew 'git'
brew 'htop'
brew 'httpie'
brew 'jq'
brew 'k6'
brew 'kafka'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'mackup'
brew 'maven'
brew 'nginx'
brew 'node'
brew 'openjdk'
brew 'openjdk@11'
brew 'podman'
brew 'postgresql@13'
brew 'pulumi'
brew 'telnet'
brew 'trash'
brew 'tree'
brew 'wget'
brew 'yarn'
brew 'zsh'

# Apps
cask '1password'
cask 'cloudflare-warp'
cask 'corretto'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'fantastical'
cask 'github'
cask 'google-chrome'
cask 'google-drive'
cask 'insomnia'
cask 'intellij-idea'
cask 'iterm2'
cask 'microsoft-powerpoint'
cask 'microsoft-teams'
cask 'microsoft-word'
cask 'miro'
cask 'notion'
cask 'oracle-jdk'
cask 'perimeter81'
cask 'podman-desktop'
cask 'signal'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'tableplus'
cask 'temurin19'
cask 'visual-studio-code'
cask 'zoom'
