# Binaries
brew 'ansible'
brew 'awscli'
brew 'git'
brew 'htop'
brew 'httpie'
brew 'jq'
brew 'mas' # Mac App Store manager
brew 'maven'
brew 'nginx'
brew 'node'
brew 'podman'
brew 'podman-compose'
brew 'pulumi'
brew 'telnet'
brew 'trash'
brew 'tree'
brew 'wget'
brew 'zsh'

# Apps
cask '1password'
cask '1password-cli'
cask 'citrix-workspace'
cask 'cloudflare-warp'
cask 'corretto@21'
cask 'discord'
cask 'docker-desktop'
cask 'fantastical'
cask 'github'
cask 'google-chrome'
cask 'google-drive'
cask 'intellij-idea'
cask 'iterm2'
cask 'microsoft-excel'
cask 'microsoft-powerpoint'
cask 'microsoft-teams'
cask 'microsoft-word'
cask 'miro'
cask 'notion'
cask 'nucleo'
cask 'onedrive'
cask 'podman-desktop'
cask 'raspberry-pi-imager'
cask 'rectangle'
cask 'signal'
cask 'slack'
cask 'utm'
cask 'visual-studio-code'
cask 'zoom'

# Fonts
cask 'font-montserrat'

# Mac App Store
mas 'Microsoft To Do', id: 1274495053
